// 1. 正則表達式編寫


// 編寫一個正則表達式, 用於驗證IP地址, 並且可以提取IP地址中的各個string 並且遞迴boolen值
// 地址範圍要求: 192.168.10.1 到 192.168.100.255

function checkIP(ip) {
    var reg = /^192\.168\.(1[0-9][0-9]|100)\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])$/;
    return reg.test(ip);
}



_____________________________________________________________________________________________________________________________


//編寫一個正則表達式, 用於驗證密碼複雜度, 密碼要求: 8-16位, 必須包含大小寫字母, 數字, 特殊字符 並且不能有空格 例如: w34fery65@#$%^
//string 並且遞迴boolen值

function checkPassword(password) {
    var reg = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[!@#$%^&*])[A-Za-z\d!@#$%^&*]{8,16}$/;
    return reg.test(password);
}
